<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentification par défaut
    |--------------------------------------------------------------------------
    |
    */

    'defaults' => [
        'guard' => 'web',
        'passwords' => 'users',
    ],

    /*
    |--------------------------------------------------------------------------
    | Gardes d'authenfication
    |--------------------------------------------------------------------------
    |
    | Supporté: "session"
    |
    */

    'guards' => [
        'web' => [
            'driver' => 'session',
            'provider' => 'users',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Gestionnaires d'utilisateurs 'User'
    |--------------------------------------------------------------------------
    |
    | Supportés: "database", "eloquent"
    |
    */

    'providers' => [
        'users' => [
            'driver' => 'eloquent',
            'model' => App\Models\User::class,
        ],

        // 'users' => [
        //     'driver' => 'database',
        //     'table' => 'users',
        // ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Réinitialisation des mots de passe
    |--------------------------------------------------------------------------
    |
    */

    'passwords' => [
        'users' => [
            'provider' => 'users',
            'table' => 'password_resets',
            'expire' => 60,
            'throttle' => 60,
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Timeout pour la confirmation du mot de passe (max. 3 heures)
    |--------------------------------------------------------------------------
    |
    */

    'password_timeout' => 10800,

];
